GopalSaraf/Practicals/PSDL/include/proc/pic18f66j90.inc
// Register: CTMUCONH
#define CTMUCONH CTMUCONH
CTMUCONH                                 equ 0F57h
// bitfield definitions
CTMUCONH_CTTRIG_POSN                     equ 0000h
CTMUCONH_CTTRIG_POSITION                 equ 0000h
CTMUCONH_CTTRIG_SIZE                     equ 0001h
CTMUCONH_CTTRIG_LENGTH                   equ 0001h
CTMUCONH_CTTRIG_MASK                     equ 0001h
CTMUCONH_IDISSEN_POSN                    equ 0001h
CTMUCONH_IDISSEN_POSITION                equ 0001h
CTMUCONH_IDISSEN_SIZE                    equ 0001h
CTMUCONH_IDISSEN_LENGTH                  equ 0001h
CTMUCONH_IDISSEN_MASK                    equ 0002h
CTMUCONH_EDGSEQEN_POSN                   equ 0002h
CTMUCONH_EDGSEQEN_POSITION               equ 0002h
CTMUCONH_EDGSEQEN_SIZE                   equ 0001h
CTMUCONH_EDGSEQEN_LENGTH                 equ 0001h
CTMUCONH_EDGSEQEN_MASK                   equ 0004h
CTMUCONH_EDGEN_POSN                      equ 0003h
CTMUCONH_EDGEN_POSITION                  equ 0003h
CTMUCONH_EDGEN_SIZE                      equ 0001h
CTMUCONH_EDGEN_LENGTH                    equ 0001h
CTMUCONH_EDGEN_MASK                      equ 0008h
CTMUCONH_TGEN_POSN                       equ 0004h
CTMUCONH_TGEN_POSITION                   equ 0004h
CTMUCONH_TGEN_SIZE                       equ 0001h
CTMUCONH_TGEN_LENGTH                     equ 0001h
CTMUCONH_TGEN_MASK                       equ 0010h
CTMUCONH_CTMUSIDL_POSN                   equ 0005h
CTMUCONH_CTMUSIDL_POSITION               equ 0005h
CTMUCONH_CTMUSIDL_SIZE                   equ 0001h
CTMUCONH_CTMUSIDL_LENGTH                 equ 0001h
CTMUCONH_CTMUSIDL_MASK                   equ 0020h
CTMUCONH_CTMUEN_POSN                     equ 0007h
CTMUCONH_CTMUEN_POSITION                 equ 0007h
CTMUCONH_CTMUEN_SIZE                     equ 0001h
CTMUCONH_CTMUEN_LENGTH                   equ 0001h
CTMUCONH_CTMUEN_MASK                     equ 0080h

// Register: ALRMVALL
#define ALRMVALL ALRMVALL
ALRMVALL                                 equ 0F58h
// bitfield definitions
ALRMVALL_ALRMVALL_POSN                   equ 0000h
ALRMVALL_ALRMVALL_POSITION               equ 0000h
ALRMVALL_ALRMVALL_SIZE                   equ 0008h
ALRMVALL_ALRMVALL_LENGTH                 equ 0008h
ALRMVALL_ALRMVALL_MASK                   equ 00FFh

// Register: ALRMVALH
#define ALRMVALH ALRMVALH
ALRMVALH                                 equ 0F59h
// bitfield definitions
ALRMVALH_ALRMVALH_POSN                   equ 0000h
ALRMVALH_ALRMVALH_POSITION               equ 0000h
ALRMVALH_ALRMVALH_SIZE                   equ 0008h
ALRMVALH_ALRMVALH_LENGTH                 equ 0008h
ALRMVALH_ALRMVALH_MASK                   equ 00FFh

// Register: ALRMRPT
#define ALRMRPT ALRMRPT
ALRMRPT                                  equ 0F5Ah
// bitfield definitions
ALRMRPT_ARPT_POSN                        equ 0000h
ALRMRPT_ARPT_POSITION                    equ 0000h
ALRMRPT_ARPT_SIZE                        equ 0008h
ALRMRPT_ARPT_LENGTH                      equ 0008h
ALRMRPT_ARPT_MASK                        equ 00FFh
ALRMRPT_ARPT0_POSN                       equ 0000h
ALRMRPT_ARPT0_POSITION                   equ 0000h
ALRMRPT_ARPT0_SIZE                       equ 0001h
ALRMRPT_ARPT0_LENGTH                     equ 0001h
ALRMRPT_ARPT0_MASK                       equ 0001h
ALRMRPT_ARPT1_POSN                       equ 0001h
ALRMRPT_ARPT1_POSITION                   equ 0001h
ALRMRPT_ARPT1_SIZE                       equ 0001h
ALRMRPT_ARPT1_LENGTH                     equ 0001h
ALRMRPT_ARPT1_MASK                       equ 0002h
ALRMRPT_ARPT2_POSN                       equ 0002h
ALRMRPT_ARPT2_POSITION                   equ 0002h
ALRMRPT_ARPT2_SIZE                       equ 0001h
ALRMRPT_ARPT2_LENGTH                     equ 0001h
ALRMRPT_ARPT2_MASK                       equ 0004h
ALRMRPT_ARPT3_POSN                       equ 0003h
ALRMRPT_ARPT3_POSITION                   equ 0003h
ALRMRPT_ARPT3_SIZE                       equ 0001h
ALRMRPT_ARPT3_LENGTH                     equ 0001h
ALRMRPT_ARPT3_MASK                       equ 0008h
ALRMRPT_ARPT4_POSN                       equ 0004h
ALRMRPT_ARPT4_POSITION                   equ 0004h
ALRMRPT_ARPT4_SIZE                       equ 0001h
ALRMRPT_ARPT4_LENGTH                     equ 0001h
ALRMRPT_ARPT4_MASK                       equ 0010h
ALRMRPT_ARPT5_POSN                       equ 0005h
ALRMRPT_ARPT5_POSITION                   equ 0005h
ALRMRPT_ARPT5_SIZE                       equ 0001h
ALRMRPT_ARPT5_LENGTH                     equ 0001h
ALRMRPT_ARPT5_MASK                       equ 0020h
ALRMRPT_ARPT6_POSN                       equ 0006h
ALRMRPT_ARPT6_POSITION                   equ 0006h
ALRMRPT_ARPT6_SIZE                       equ 0001h
ALRMRPT_ARPT6_LENGTH                     equ 0001h
ALRMRPT_ARPT6_MASK                       equ 0040h
ALRMRPT_ARPT7_POSN                       equ 0007h
ALRMRPT_ARPT7_POSITION                   equ 0007h
ALRMRPT_ARPT7_SIZE                       equ 0001h
ALRMRPT_ARPT7_LENGTH                     equ 0001h
ALRMRPT_ARPT7_MASK                       equ 0080h

// Register: ALRMCFG
#define ALRMCFG ALRMCFG
ALRMCFG                                  equ 0F5Bh
// bitfield definitions
ALRMCFG_ALRMPTR_POSN                     equ 0000h
ALRMCFG_ALRMPTR_POSITION                 equ 0000h
ALRMCFG_ALRMPTR_SIZE                     equ 0002h
ALRMCFG_ALRMPTR_LENGTH                   equ 0002h
ALRMCFG_ALRMPTR_MASK                     equ 0003h
ALRMCFG_AMASK_POSN                       equ 0002h
ALRMCFG_AMASK_POSITION                   equ 0002h
ALRMCFG_AMASK_SIZE                       equ 0004h
ALRMCFG_AMASK_LENGTH                     equ 0004h
ALRMCFG_AMASK_MASK                       equ 003Ch
ALRMCFG_CHIME_POSN                       equ 0006h
ALRMCFG_CHIME_POSITION                   equ 0006h
ALRMCFG_CHIME_SIZE                       equ 0001h
ALRMCFG_CHIME_LENGTH                     equ 0001h
ALRMCFG_CHIME_MASK                       equ 0040h
ALRMCFG_ALRMEN_POSN                      equ 0007h
ALRMCFG_ALRMEN_POSITION                  equ 0007h
ALRMCFG_ALRMEN_SIZE                      equ 0001h
ALRMCFG_ALRMEN_LENGTH                    equ 0001h
ALRMCFG_ALRMEN_MASK                      equ 0080h
ALRMCFG_ALRMPTR0_POSN                    equ 0000h
ALRMCFG_ALRMPTR0_POSITION                equ 0000h
ALRMCFG_ALRMPTR0_SIZE                    equ 0001h
ALRMCFG_ALRMPTR0_LENGTH                  equ 0001h
ALRMCFG_ALRMPTR0_MASK                    equ 0001h
ALRMCFG_ALRMPTR1_POSN                    equ 0001h
ALRMCFG_ALRMPTR1_POSITION                equ 0001h
ALRMCFG_ALRMPTR1_SIZE                    equ 0001h
ALRMCFG_ALRMPTR1_LENGTH                  equ 0001h
ALRMCFG_ALRMPTR1_MASK                    equ 0002h
ALRMCFG_AMASK0_POSN                      equ 0002h
ALRMCFG_AMASK0_POSITION                  equ 0002h
ALRMCFG_AMASK0_SIZE                      equ 0001h
ALRMCFG_AMASK0_LENGTH                    equ 0001h
ALRMCFG_AMASK0_MASK                      equ 0004h
ALRMCFG_AMASK1_POSN                      equ 0003h
ALRMCFG_AMASK1_POSITION                  equ 0003h
ALRMCFG_AMASK1_SIZE                      equ 0001h
ALRMCFG_AMASK1_LENGTH                    equ 0001h
ALRMCFG_AMASK1_MASK                      equ 0008h
ALRMCFG_AMASK2_POSN                      equ 0004h
ALRMCFG_AMASK2_POSITION                  equ 0004h
ALRMCFG_AMASK2_SIZE                      equ 0001h
ALRMCFG_AMASK2_LENGTH                    equ 0001h
ALRMCFG_AMASK2_MASK                      equ 0010h
ALRMCFG_AMASK3_POSN                      equ 0005h
ALRMCFG_AMASK3_POSITION                  equ 0005h
ALRMCFG_AMASK3_SIZE                      equ 0001h
ALRMCFG_AMASK3_LENGTH                    equ 0001h
ALRMCFG_AMASK3_MASK                      equ 0020h

// Register: RTCVALL
#define RTCVALL RTCVALL
RTCVALL                                  equ 0F5Ch
// bitfield definitions
RTCVALL_RTCVALL_POSN                     equ 0000h
RTCVALL_RTCVALL_POSITION                 equ 0000h
RTCVALL_RTCVALL_SIZE                     equ 0008h
RTCVALL_RTCVALL_LENGTH                   equ 0008h
RTCVALL_RTCVALL_MASK                     equ 00FFh

// Register: RTCVALH
#define RTCVALH RTCVALH
RTCVALH                                  equ 0F5Dh
// bitfield definitions
RTCVALH_RTCVALH_POSN                     equ 0000h
RTCVALH_RTCVALH_POSITION                 equ 0000h
RTCVALH_RTCVALH_SIZE                     equ 0008h
RTCVALH_RTCVALH_LENGTH                   equ 0008h
RTCVALH_RTCVALH_MASK                     equ 00FFh
RTCVALH_WAITE0_POSN                      equ 0000h
RTCVALH_WAITE0_POSITION                  equ 0000h
RTCVALH_WAITE0_SIZE                      equ 0001h
RTCVALH_WAITE0_LENGTH                    equ 0001h
RTCVALH_WAITE0_MASK                      equ 0001h
RTCVALH_WAITE1_POSN                      equ 0001h
RTCVALH_WAITE1_POSITION                  equ 0001h
RTCVALH_WAITE1_SIZE                      equ 0001h
RTCVALH_WAITE1_LENGTH                    equ 0001h
RTCVALH_WAITE1_MASK                      equ 0002h
RTCVALH_WAITM0_POSN                      equ 0002h
RTCVALH_WAITM0_POSITION                  equ 0002h
RTCVALH_WAITM0_SIZE                      equ 0001h
RTCVALH_WAITM0_LENGTH                    equ 0001h
RTCVALH_WAITM0_MASK                      equ 0004h
RTCVALH_WAITM1_POSN                      equ 0003h
RTCVALH_WAITM1_POSITION                  equ 0003h
RTCVALH_WAITM1_SIZE                      equ 0001h
RTCVALH_WAITM1_LENGTH                    equ 0001h
RTCVALH_WAITM1_MASK                      equ 0008h
RTCVALH_WAITM2_POSN                      equ 0004h
RTCVALH_WAITM2_POSITION                  equ 0004h
RTCVALH_WAITM2_SIZE                      equ 0001h
RTCVALH_WAITM2_LENGTH                    equ 0001h
RTCVALH_WAITM2_MASK                      equ 0010h
RTCVALH_WAITM3_POSN                      equ 0005h
RTCVALH_WAITM3_POSITION                  equ 0005h
RTCVALH_WAITM3_SIZE                      equ 0001h
RTCVALH_WAITM3_LENGTH                    equ 0001h
RTCVALH_WAITM3_MASK                      equ 0020h
RTCVALH_WAITB0_POSN                      equ 0006h
RTCVALH_WAITB0_POSITION                  equ 0006h
RTCVALH_WAITB0_SIZE                      equ 0001h
RTCVALH_WAITB0_LENGTH                    equ 0001h
RTCVALH_WAITB0_MASK                      equ 0040h
RTCVALH_WAITB1_POSN                      equ 0007h
RTCVALH_WAITB1_POSITION                  equ 0007h
RTCVALH_WAITB1_SIZE                      equ 0001h
RTCVALH_WAITB1_LENGTH                    equ 0001h
RTCVALH_WAITB1_MASK                      equ 0080h

// Register: RTCCAL
#define RTCCAL RTCCAL
RTCCAL                                   equ 0F5Eh
// bitfield definitions
RTCCAL_CAL_POSN                          equ 0000h
RTCCAL_CAL_POSITION                      equ 0000h
RTCCAL_CAL_SIZE                          equ 0008h
RTCCAL_CAL_LENGTH                        equ 0008h
RTCCAL_CAL_MASK                          equ 00FFh
RTCCAL_CAL0_POSN                         equ 0000h
RTCCAL_CAL0_POSITION                     equ 0000h
RTCCAL_CAL0_SIZE                         equ 0001h
RTCCAL_CAL0_LENGTH                       equ 0001h
RTCCAL_CAL0_MASK                         equ 0001h
RTCCAL_CAL1_POSN                         equ 0001h
RTCCAL_CAL1_POSITION                     equ 0001h
RTCCAL_CAL1_SIZE                         equ 0001h
RTCCAL_CAL1_LENGTH                       equ 0001h
RTCCAL_CAL1_MASK                         equ 0002h
RTCCAL_CAL2_POSN                         equ 0002h
RTCCAL_CAL2_POSITION                     equ 0002h
RTCCAL_CAL2_SIZE                         equ 0001h
RTCCAL_CAL2_LENGTH                       equ 0001h
RTCCAL_CAL2_MASK                         equ 0004h
RTCCAL_CAL3_POSN                         equ 0003h
RTCCAL_CAL3_POSITION                     equ 0003h
RTCCAL_CAL3_SIZE                         equ 0001h
RTCCAL_CAL3_LENGTH                       equ 0001h
RTCCAL_CAL3_MASK                         equ 0008h
RTCCAL_CAL4_POSN                         equ 0004h
RTCCAL_CAL4_POSITION                     equ 0004h
RTCCAL_CAL4_SIZE                         equ 0001h
RTCCAL_CAL4_LENGTH                       equ 0001h
RTCCAL_CAL4_MASK                         equ 0010h
RTCCAL_CAL5_POSN                         equ 0005h
RTCCAL_CAL5_POSITION                     equ 0005h
RTCCAL_CAL5_SIZE                         equ 0001h
RTCCAL_CAL5_LENGTH                       equ 0001h
RTCCAL_CAL5_MASK                         equ 0020h
RTCCAL_CAL6_POSN                         equ 0006h
RTCCAL_CAL6_POSITION                     equ 0006h
RTCCAL_CAL6_SIZE                         equ 0001h
RTCCAL_CAL6_LENGTH                       equ 0001h
RTCCAL_CAL6_MASK                         equ 0040h
RTCCAL_CAL7_POSN                         equ 0007h
RTCCAL_CAL7_POSITION                     equ 0007h
RTCCAL_CAL7_SIZE                         equ 0001h
RTCCAL_CAL7_LENGTH                       equ 0001h
RTCCAL_CAL7_MASK                         equ 0080h

// Register: RTCCFG
#define RTCCFG RTCCFG
RTCCFG                                   equ 0F5Fh
// bitfield definitions
RTCCFG_RTCPTR0_POSN                      equ 0000h
RTCCFG_RTCPTR0_POSITION                  equ 0000h
RTCCFG_RTCPTR0_SIZE                      equ 0001h
RTCCFG_RTCPTR0_LENGTH                    equ 0001h
RTCCFG_RTCPTR0_MASK                      equ 0001h
RTCCFG_RTCPTR1_POSN                      equ 0001h
RTCCFG_RTCPTR1_POSITION                  equ 0001h
RTCCFG_RTCPTR1_SIZE                      equ 0001h
RTCCFG_RTCPTR1_LENGTH                    equ 0001h
RTCCFG_RTCPTR1_MASK                      equ 0002h
RTCCFG_RTCOE_POSN                        equ 0002h
RTCCFG_RTCOE_POSITION                    equ 0002h
RTCCFG_RTCOE_SIZE                        equ 0001h
RTCCFG_RTCOE_LENGTH                      equ 0001h
RTCCFG_RTCOE_MASK                        equ 0004h
RTCCFG_HALFSEC_POSN                      equ 0003h
RTCCFG_HALFSEC_POSITION                  equ 0003h
RTCCFG_HALFSEC_SIZE                      equ 0001h
RTCCFG_HALFSEC_LENGTH                    equ 0001h
RTCCFG_HALFSEC_MASK                      equ 0008h
RTCCFG_RTCSYNC_POSN                      equ 0004h
RTCCFG_RTCSYNC_POSITION                  equ 0004h
RTCCFG_RTCSYNC_SIZE                      equ 0001h
RTCCFG_RTCSYNC_LENGTH                    equ 0001h
RTCCFG_RTCSYNC_MASK                      equ 0010h
RTCCFG_RTCWREN_POSN                      equ 0005h
RTCCFG_RTCWREN_POSITION                  equ 0005h
RTCCFG_RTCWREN_SIZE                      equ 0001h
RTCCFG_RTCWREN_LENGTH                    equ 0001h
RTCCFG_RTCWREN_MASK                      equ 0020h
RTCCFG_RTCEN_POSN                        equ 0007h
RTCCFG_RTCEN_POSITION                    equ 0007h
RTCCFG_RTCEN_SIZE                        equ 0001h
RTCCFG_RTCEN_LENGTH                      equ 0001h
RTCCFG_RTCEN_MASK                        equ 0080h

// Register: RCSTA2
#define RCSTA2 RCSTA2
RCSTA2                                   equ 0F60h
// bitfield definitions
RCSTA2_RX9D_POSN                         equ 0000h
RCSTA2_RX9D_POSITION                     equ 0000h
RCSTA2_RX9D_SIZE                         equ 0001h
RCSTA2_RX9D_LENGTH                       equ 0001h
RCSTA2_RX9D_MASK                         equ 0001h
RCSTA2_OERR_POSN                         equ 0001h
RCSTA2_OERR_POSITION                     equ 0001h
RCSTA2_OERR_SIZE                         equ 0001h
RCSTA2_OERR_LENGTH                       equ 0001h
RCSTA2_OERR_MASK                         equ 0002h
RCSTA2_FERR_POSN                         equ 0002h
RCSTA2_FERR_POSITION                     equ 0002h
RCSTA2_FERR_SIZE                         equ 0001h
RCSTA2_FERR_LENGTH                       equ 0001h
RCSTA2_FERR_MASK                         equ 0004h
RCSTA2_ADDEN_POSN                        equ 0003h
RCSTA2_ADDEN_POSITION                    equ 0003h
RCSTA2_ADDEN_SIZE                        equ 0001h
RCSTA2_ADDEN_LENGTH                      equ 0001h
RCSTA2_ADDEN_MASK                        equ 0008h
RCSTA2_CREN_POSN                         equ 0004h
RCSTA2_CREN_POSITION                     equ 0004h
RCSTA2_CREN_SIZE                         equ 0001h
RCSTA2_CREN_LENGTH                       equ 0001h
RCSTA2_CREN_MASK                         equ 0010h
RCSTA2_SREN_POSN                         equ 0005h
RCSTA2_SREN_POSITION                     equ 0005h
RCSTA2_SREN_SIZE                         equ 0001h
RCSTA2_SREN_LENGTH                       equ 0001h
RCSTA2_SREN_MASK                         equ 0020h
RCSTA2_RX9_POSN                          equ 0006h
RCSTA2_RX9_POSITION                      equ 0006h
RCSTA2_RX9_SIZE                          equ 0001h
RCSTA2_RX9_LENGTH                        equ 0001h
RCSTA2_RX9_MASK                          equ 0040h
RCSTA2_SPEN_POSN                         equ 0007h
RCSTA2_SPEN_POSITION                     equ 0007h
RCSTA2_SPEN_SIZE                         equ 0001h
RCSTA2_SPEN_LENGTH                       equ 0001h
RCSTA2_SPEN_MASK                         equ 0080h
RCSTA2_RCD8_POSN                         equ 0000h
RCSTA2_RCD8_POSITION                     equ 0000h
RCSTA2_RCD8_SIZE                         equ 0001h
RCSTA2_RCD8_LENGTH                       equ 0001h
RCSTA2_RCD8_MASK                         equ 0001h
RCSTA2_RC9_POSN                          equ 0006h
RCSTA2_RC9_POSITION                      equ 0006h
RCSTA2_RC9_SIZE                          equ 0001h
RCSTA2_RC9_LENGTH                        equ 0001h
RCSTA2_RC9_MASK                          equ 0040h
RCSTA2_NOT_RC8_POSN                      equ 0006h
RCSTA2_NOT_RC8_POSITION                  equ 0006h
RCSTA2_NOT_RC8_SIZE                      equ 0001h
RCSTA2_NOT_RC8_LENGTH                    equ 0001h
RCSTA2_NOT_RC8_MASK                      equ 0040h
RCSTA2_RC8_9_POSN                        equ 0006h
RCSTA2_RC8_9_POSITION                    equ 0006h
RCSTA2_RC8_9_SIZE                        equ 0001h
RCSTA2_RC8_9_LENGTH                      equ 0001h
RCSTA2_RC8_9_MASK                        equ 0040h
RCSTA2_RX9D2_POSN                        equ 0000h
RCSTA2_RX9D2_POSITION                    equ 0000h
RCSTA2_RX9D2_SIZE                        equ 0001h
RCSTA2_RX9D2_LENGTH                      equ 0001h
RCSTA2_RX9D2_MASK                        equ 0001h
RCSTA2_OERR2_POSN                        equ 0001h
RCSTA2_OERR2_POSITION                    equ 0001h
RCSTA2_OERR2_SIZE                        equ 0001h
RCSTA2_OERR2_LENGTH                      equ 0001h
RCSTA2_OERR2_MASK                        equ 0002h
RCSTA2_FERR2_POSN                        equ 0002h
RCSTA2_FERR2_POSITION                    equ 0002h
RCSTA2_FERR2_SIZE                        equ 0001h
RCSTA2_FERR2_LENGTH                      equ 0001h
RCSTA2_FERR2_MASK                        equ 0004h
RCSTA2_ADDEN2_POSN                       equ 0003h
RCSTA2_ADDEN2_POSITION                   equ 0003h
RCSTA2_ADDEN2_SIZE                       equ 0001h
RCSTA2_ADDEN2_LENGTH                     equ 0001h
RCSTA2_ADDEN2_MASK                       equ 0008h
RCSTA2_CREN2_POSN                        equ 0004h
RCSTA2_CREN2_POSITION                    equ 0004h
RCSTA2_CREN2_SIZE                        equ 0001h
RCSTA2_CREN2_LENGTH                      equ 0001h
RCSTA2_CREN2_MASK                        equ 0010h
RCSTA2_SREN2_POSN                        equ 0005h
RCSTA2_SREN2_POSITION                    equ 0005h
RCSTA2_SREN2_SIZE                        equ 0001h
RCSTA2_SREN2_LENGTH                      equ 0001h
RCSTA2_SREN2_MASK                        equ 0020h
RCSTA2_RX92_POSN                         equ 0006h
RCSTA2_RX92_POSITION                     equ 0006h
RCSTA2_RX92_SIZE                         equ 0001h
RCSTA2_RX92_LENGTH                       equ 0001h
RCSTA2_RX92_MASK                         equ 0040h
RCSTA2_SPEN2_POSN                        equ 0007h
RCSTA2_SPEN2_POSITION                    equ 0007h
RCSTA2_SPEN2_SIZE                        equ 0001h
RCSTA2_SPEN2_LENGTH                      equ 0001h
RCSTA2_SPEN2_MASK                        equ 0080h
RCSTA2_RCD82_POSN                        equ 0000h
RCSTA2_RCD82_POSITION                    equ 0000h
RCSTA2_RCD82_SIZE                        equ 0001h
RCSTA2_RCD82_LENGTH                      equ 0001h
RCSTA2_RCD82_MASK                        equ 0001h
RCSTA2_RC8_92_POSN                       equ 0006h
RCSTA2_RC8_92_POSITION                   equ 0006h
RCSTA2_RC8_92_SIZE                       equ 0001h
RCSTA2_RC8_92_LENGTH                     equ 0001h
RCSTA2_RC8_92_MASK                       equ 0040h
RCSTA2_RC92_POSN                         equ 0006h
RCSTA2_RC92_POSITION                     equ 0006h
RCSTA2_RC92_SIZE                         equ 0001h
RCSTA2_RC92_LENGTH                       equ 0001h
RCSTA2_RC92_MASK                         equ 0040h

